shoppeur/app/controllers/admin_controller.rb

SELECT * FROM `products` LIMIT 0, 10
SELECT count(*) AS count_all FROM `products`
---
  def list
      @products = Product.paginate :page => params[:page], :per_page => 10

SELECT * FROM `products` WHERE (`products`.`id` = 6)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`price`, `title`, `image_url`, `date_available`, `description`) VALUES(15.0, 'Catalyseur', 'http://www.fotosearch.com/bthumb/CSP/CSP267/k2679246.jpeg', '2010-02-10 00:00:00', 'Catalyse et encapsule les mauvaises odeurs dans des boites ultra hygiénique spéciale et surtout très utile\r\nÀ consommer sans modération et surtout quand il faut')
---
  def create
    @product = Product.new(params[:product])

    if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def update
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 1)
DELETE FROM `products` WHERE `id` = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy