shoppeur/app/controllers/login_controller.rb

SELECT count(shipped_at is null) AS count_shipped_at_is_null FROM `orders`
---
  def index
    @total_orders = Order.count

INSERT INTO `users` (`name`, `hashed_password`) VALUES('jeje', 'ad930d57ccd78b88bf3d2ef72d416fc146e98154')
---
  def add_user
    if request.get?
      @user = User.new
    else
      @user = User.new(params[:user])
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 0)
DELETE FROM `users` WHERE `id` = 2
---
  def delete_user
    id = params[:id]
    if id && user = User.find(id)
      begin
        user.destroy