shoppeur/app/controllers/store_controller.rb

SELECT * FROM `products` WHERE (date_available <= now()) ORDER BY date_available desc
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 2)
---
  def add_to_cart
    begin
      product = Product.find(params[:id])

INSERT INTO `line_items` (`product_id`, `quantity`, `order_id`, `total_price`) VALUES(8, 1, 1, 15.0)
INSERT INTO `orders` (`name`, `address`, `shipped_at`, `pay_type`, `email`) VALUES('Abderrazik Tarek', '2915 edouard montpetit', NULL, 'cc', 'tareekabder@hotmail.com')
---
  def save_order
    @order = Order.new(params[:order])   # <label id="code.p.new.order" />
    @order.add_line_items_from_cart(@cart)
    if @order.save                       # <label id="code.p.save" />